Repository: magopian/django-payline
Catalog: payline/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Expiry date format must be MMYY
fr: Le format de la date d'expiration doit être MMYY (mois sur deux chiffres, et deux derniers chiffres de l'année)

source: Expiry date must be in the future
fr: La date d'expérition doit être dans le futur

source: Card CVX code
fr: Code CVX

source: Security code, three numbers from the back of the payment card
fr: Code de sécurité, trois numéros au dos de la carte de paiement

source: Card owner first name
fr: Prénom du titulaire de la carte

source: Card owner last name
fr: Nom du titulaire de la carte

source: Format: MMYY (eg 0213 for february 2013)
fr: Format : MMYY (exemple 0213 pour février 2013)

source: wallet
fr: portefeuille

source: wallets
fr: portefeuilles

source: Wallet holding payment information
fr: Portefeuille contenant les informations de paiement

source: When the account was created
fr: Quand le compte a été créé

source: Payment backend failure, please try again later.
fr: Erreur du terminal de paiement, veuillez réessayer plus tard.

source: Enterprise account page: Payment details
fr: Page de compte entreprise : informations de paiement

source: Owner's first name:
fr: Prénom du titulaire :

source: Owner's last name:
fr: Nom du titulaire :

source: Card type:
fr: Type de la carte :

source: Card number:
fr: Numéro de la carte :

source: Card expiration date:
fr: Date d'expiration de la carte :

source: Change this card
fr: Changer cette carte

source: Enterprise account page: change payment details
fr: Page de compte entreprise : changement des informations de paiement

source: Fear not, this is safe!
fr: N'ayez crainte, c'est sécurisé !

source: Check the URL in the location bar, right at the top of your browser: there's a lock on the left of the address, validating that you're on a page secured by SSL
fr: Vérifiez l'URL dans la barre d'adresse, tout en haut de votre navigateur : il y a un cadenas à gauche de l'adresse, confirmant que vous êtes sur une page sécurisée par SSL

source: Also, we can guarantee you that we're not storing your payment card information on our servers, we're in fact trusting our PCI-DSS compliant partner:
fr: De plus, nous vous garantissons que nous ne stockons pas vos informations de paiement sur nos serveurs, pour cela nous faisons confiance à notre partenaire certifié PCI-DSS :

source: Update wallet
fr: Mise à jour du portefeuille

source: Create wallet
fr: Créer le portefeuille
